<template>
    <el-container class="home">
      <!-- 头部 -->
      <el-header>
        <div>
          <svg t="1624079998242" class="icon logo" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4666" width="200" height="200"><path d="M960.45056 328.73472h-49.59232c-7.26016 0-13.312 4.84352-16.93696 10.88512L873.3696 386.7648c-2.42688 7.24992-1.20832 15.69792 3.62496 20.54144l35.072 35.05152-38.7072 38.7072-35.072-35.06176c-4.83328-4.84352-12.10368-7.26016-19.36384-3.6352l-48.384 19.3536c-7.24992 2.41664-12.0832 9.65632-12.0832 16.90624v56.832h-55.6544v-56.832c0-7.24992-4.84352-14.49984-10.87488-16.91648l-47.18592-20.55168c-7.24992-2.41664-14.52032-1.20832-19.3536 3.62496l-36.28032 36.27008-38.7072-38.69696 35.06176-35.05152c4.84352-4.83328 7.2704-13.29152 3.6352-20.54144l-19.3536-48.36352c-2.42688-7.24992-9.6768-12.0832-16.93696-12.0832h-50.80064v-54.40512h49.59232c7.24992 0 13.312-4.82304 16.92672-10.87488l20.57216-47.13472c2.41664-7.24992 1.20832-15.7184-3.6352-20.55168l-35.06176-35.06176 38.7072-38.68672 35.06176 35.06176c4.84352 4.82304 12.10368 7.24992 19.37408 3.62496l48.384-19.34336c7.24992-2.42688 12.0832-9.6768 12.0832-16.92672V65.20832h55.6544v56.81152c0 7.24992 4.83328 14.49984 10.87488 16.92672l47.18592 20.54144c7.24992 2.42688 14.51008 1.21856 19.3536-3.61472l36.28032-36.27008 38.7072 38.68672-35.072 35.06176c-4.83328 4.83328-7.2704 13.30176-3.62496 20.55168l19.3536 48.34304c2.42688 7.24992 9.6768 12.0832 16.92672 12.0832h50.81088v54.40512z" fill="#FFE7CF" p-id="4667"></path><path d="M407.9616 826.19392h40.30464v-80.1792H407.9616z" fill="#DAE6EE" p-id="4668"></path><path d="M447.62112 745.68704l0.64512 80.50688-39.64928 0.33792-0.64512-80.51712 39.64928-0.32768z m-75.79648 23.07072l-120.39168 0.99328-3.66592 0.03072-56.03328 0.4608-36.32128 0.3072-35.28704 0.28672 0.29696 37.02784 35.28704-0.29696 0.58368 73.29792 36.34176-0.3072-0.59392-73.27744 23.36768-0.2048 0.34816 44.2368 36.352-0.29696-0.36864-44.2368 120.3712-0.99328 0.256 31.9488c0.12288 14.336 11.59168 25.9072 25.6512 25.9072h0.19456l61.07136-0.512c14.1312-0.13312 25.51808-11.93984 25.3952-26.33728l-0.8192-102.31808c-0.12288-14.40768-11.48928-25.64096-25.83552-25.89696l-61.06112 0.50176c-14.12096 0.13312-25.52832 11.9296-25.40544 26.33728l0.26624 33.34144z" fill="#0E5DA1" p-id="4669"></path><path d="M960.7168 328.09984h-50.86208c-7.30112 0-13.91616 4.46464-16.7424 11.32544l-19.37408 46.8992a18.75968 18.75968 0 0 0 4.0448 20.43904l35.15392 34.93888-39.45472 39.46496-35.72736-35.49184a17.92 17.92 0 0 0-19.57888-3.88096l-47.23712 19.7632c-6.8096 2.84672-11.264 9.60512-11.264 17.11104v56.7808h-55.7056v-56.7808c0-7.56736-4.53632-14.37696-11.42784-17.18272l-48.4352-19.75296a17.93024 17.93024 0 0 0-19.44576 3.9424l-35.584 35.3792-38.5024-39.22944 34.05824-33.81248c5.30432-5.2736 6.94272-13.30176 4.12672-20.28544l-19.38432-48.13824a18.16576 18.16576 0 0 0-16.7936-11.48928h-49.664v-55.54176h49.664c7.15776 0 13.66016-4.29056 16.5888-10.9568l20.57216-46.8992c3.072-7.00416 1.5872-15.22688-3.7376-20.64384l-35.4816-36.15744 38.43072-38.4 35.71712 35.4816a17.92 17.92 0 0 0 19.43552 3.93216l48.4352-19.74272a18.55488 18.55488 0 0 0 11.42784-17.2032V65.20832h55.7056v56.7808c0 7.51616 4.4544 14.2848 11.264 17.13152l47.23712 19.74272a17.89952 17.89952 0 0 0 19.57888-3.87072l35.84-35.61472 39.2192 38.49216-35.0208 34.78528a18.7904 18.7904 0 0 0-4.12672 20.29568l19.37408 48.13824a18.176 18.176 0 0 0 16.81408 11.47904h50.86208v55.54176z m18.16576-92.5696h-56.84224l-10.10688-25.088 39.66976-39.41376a18.7392 18.7392 0 0 0-0.07168-26.59328l-65.41312-64.17408a17.89952 17.89952 0 0 0-25.27232 0.08192l-39.90528 39.64928-24.9344-10.42432V46.6944c0-10.24-8.12032-18.51392-18.16576-18.51392h-92.0576c-10.01472 0-18.15552 8.28416-18.15552 18.50368v62.7712l-26.05056 10.61888-39.9872-39.7312a17.90976 17.90976 0 0 0-25.40544 0.04096L512 144.55808c-3.47136 3.45088-5.4272 8.192-5.44768 13.12768-0.02048 4.93568 1.8944 9.6768 5.31456 13.16864l39.59808 40.35584-10.67008 24.32H484.7616c-10.0352 0-18.16576 8.2944-18.16576 18.51392v92.5696c0 10.22976 8.12032 18.50368 18.16576 18.50368h55.64416l10.10688 25.088-38.47168 38.18496c-3.4816 3.45088-5.45792 8.18176-5.4784 13.13792-0.04096 4.94592 1.88416 9.71776 5.31456 13.2096l64.19456 65.42336a17.92 17.92 0 0 0 25.53856 0.1536l39.97696-39.7312 26.05056 10.62912v62.75072c0 10.21952 8.1408 18.51392 18.16576 18.51392h92.0576c10.0352 0 18.15552-8.2944 18.15552-18.51392v-62.8736l24.9344-10.41408 39.89504 39.63904c7.0656 7.03488 18.36032 7.00416 25.41568-0.04096l65.39264-65.41312a18.72896 18.72896 0 0 0-0.0512-26.4704l-39.56736-39.3216 9.89184-23.95136h56.96512c10.0352 0 18.16576-8.27392 18.16576-18.50368v-92.5696c0-10.21952-8.12032-18.51392-18.16576-18.51392z" fill="#FFA950" p-id="4670"></path><path d="M731.82208 347.8528c-26.05056 0-47.23712-21.6064-47.23712-48.128 0-26.55232 21.18656-48.14848 47.23712-48.14848 26.04032 0 47.22688 21.59616 47.22688 48.13824 0 26.53184-21.18656 48.128-47.22688 48.128m0-133.29408c-46.08 0-83.5584 38.1952-83.5584 85.16608 0 46.9504 37.4784 85.15584 83.5584 85.15584s83.5584-38.1952 83.5584-85.15584-37.4784-85.16608-83.5584-85.16608" fill="#FFA950" p-id="4671"></path><path d="M955.88352 910.65344c0 26.76736-22.17984 49.36704-48.44544 49.36704H75.38688c-8.06912 0-10.496-1.19808-10.496-1.08544-0.3072-0.54272-1.61792-3.46112-1.61792-14.9504V514.4576c0-26.76736 22.19008-49.36704 48.44544-49.36704h264.02816v-37.02784H111.7184c-46.7456 0-84.77696 38.7584-84.77696 86.39488v429.50656c0 26.25536 5.76512 53.08416 48.44544 53.08416h832.0512c46.7456 0 84.77696-38.7584 84.77696-86.40512v-396.1856h-36.33152v396.1856z" fill="#0E5DA1" p-id="4672"></path><path d="M630.70208 806.98368H885.0432v-37.0176H630.70208zM124.45696 587.29472h96.89088v-37.02784h-96.89088zM766.94528 902.02112H806.912v-37.02784h-39.96672zM684.58496 902.02112h38.74816v-37.02784h-38.74816zM845.6704 902.03136h39.96672v-37.0176h-39.96672zM95.3856 357.71392h36.33152V28.17024H95.3856zM373.32992 357.72416v-37.02784c-68.78208 0-124.74368-57.58976-124.74368-128.36864S304.54784 63.96928 373.32992 63.96928V26.95168c-88.81152 0-161.0752 74.1888-161.0752 165.376 0 91.20768 72.26368 165.39648 161.0752 165.39648" fill="#0E5DA1" p-id="4673"></path></svg>
          <span>设备管理系统</span>
        </div>
        <el-button class="btn" type="primary" plain @click="logout">退出</el-button>
      </el-header>
      <!-- 主内容 -->
        <el-container>
          <!-- 侧边栏 -->
          <el-aside :width="isCollapse ? '64px' : '200px'">
            <!-- 菜单栏折叠按钮 -->
            <div class="toggle-button" @click="toggleCollapse">|||</div>
            <el-menu
              default-active="2"
              class="el-menu-vertical-demo"
              @open="handleOpen"
              @close="handleClose"
              background-color="#545c64"
              text-color="#fff"
              active-text-color="#ffd04b"
              unique-opened
              :router="true"
              :collapse="isCollapse">
              <!-- 菜单一 -->
              <el-submenu index="1" >
                <template slot="title">
                  <i class="el-icon-location"></i>
                  <span>设备维修</span>
                </template>
                <el-menu-item-group>
                  <!-- 给<el-menu>添加了:router="true"属性之后，
                    菜单会根据index值来实现路由的跳转 -->
                  <el-menu-item index="/maintain">定期维护</el-menu-item>
                </el-menu-item-group>
              </el-submenu>
              <!-- 菜单二 -->
              <el-submenu index="2">
                <template slot="title">
                  <!-- 图标 -->
                  <i class="el-icon-location"></i>
                  <!-- 文本 -->
                  <span>设备报废</span>
                </template>
                <el-menu-item-group>
                  <el-menu-item index="/scrapApply">报废申请</el-menu-item>
                  <el-menu-item v-if="roleRight" index="/scrapHandle">报废处理</el-menu-item>
                </el-menu-item-group>
              </el-submenu>

              <!-- 菜单三 -->
              <el-submenu v-if="roleRight" index="3">
                <template slot="title">
                  <!-- 图标 -->
                  <i class="el-icon-location"></i>
                  <!-- 文本 -->
                  <span>系统维护</span>
                </template>
                <el-menu-item-group>
                  <el-menu-item index="/userManage">用户管理</el-menu-item>
                </el-menu-item-group>
              </el-submenu>

              <!-- 菜单四 -->
              <el-submenu index="4">
                <template slot="title">
                  <!-- 图标 -->
                  <i class="el-icon-location"></i>
                  <!-- 文本 -->
                  <span>采购管理</span>
                </template>
                <el-menu-item-group>
                  <el-menu-item index="/purchaseApply">采购申请</el-menu-item>
                  <el-menu-item v-if="roleRight" index="/purchaseApprove">采购审批</el-menu-item>
                </el-menu-item-group>
              </el-submenu>


              <!-- 菜单五 -->
              <el-submenu index="5">
                <template slot="title">
                  <!-- 图标 -->
                  <i class="el-icon-location"></i>
                  <!-- 文本 -->
                  <span>设备入库</span>
                </template>
                <el-menu-item-group>
                  <el-menu-item index="/checkStorage">验收入库</el-menu-item>
                  <!-- 入库信息是该部门已入库的信息
                      例如：属于该部门的设备库信息
                      这里建议使用一个设备库总表格，
                      然后可以通过关键字过滤不同的需求信息
                      1. 部门类别
                      2. 设备类别 -->
                  <el-menu-item index="/storageMessage">入库信息</el-menu-item>
                </el-menu-item-group>
              </el-submenu>
              
            </el-menu>
          </el-aside>
          <!-- 主页面 -->
          <el-main>
            <router-view/>
          </el-main>
        </el-container>
    </el-container>
</template>

<script>
export default {
  data() {
    return {
      isCollapse: false,
      roleRight:'',
      // 一级菜单
      // menulist: [{id: 01, authName: "目录一"}],
    }
  },
  name: 'Home',
  methods: {
      handleOpen(key, keyPath) {
        console.log(key, keyPath);
      },
      handleClose(key, keyPath) {
        console.log(key, keyPath);
      },
      toggleCollapse() {
        this.isCollapse = !this.isCollapse
      },
      logout() {
        window.sessionStorage.clear()
        this.$router.push('/login')
      }
    },
    created() {
      this.roleRight = this.$store.state.useRight
      console.log(this.roleRight)
    },
    
}
</script>

<style  scoped >


  .toggle-button {
    background-color: #363d47;
    font-size: 12px;
    color: rgba(235, 229, 229, 0.795);
    line-height: 18px;
    cursor: pointer;
    letter-spacing: 0.2em;
  }

  .logo {
    width: 30px;
    height: 30px;
    padding-right: 20px;
    margin-top: 10px;
  }

  .btn {
    margin: 10px;
  }


  .home {
    height: 100%;
  }

  .el-header {
    /* background: #255db1; */
    background-color: #a2a8b1;
    color: #333;
    text-align: center;
    line-height: 60px;
    display: flex;
    justify-content: space-between;
    border-radius: 20px;
    /* align-items: center; */
  }
  
  .el-aside {
    background-color: #363d47;
    color: rgb(146, 67, 67);
    text-align: center;
    line-height: 200px;
    border-radius: 10px;
  }

  
  .el-main {
    background-color: #1d344b;
    color: rgb(190, 186, 186);
    text-align: center;
    line-height: 160px;
    border-radius: 10px;
  }
  
  body > .el-container {
    margin-bottom: 40px;
  }
  
  .el-container:nth-child(5) .el-aside,
  .el-container:nth-child(6) .el-aside {
    line-height: 260px;
  }
  
  .el-container:nth-child(7) .el-aside {
    line-height: 320px;
  }
</style>
